"""Заняття 5 · Демонстрація 2. Параметри та return.
"""


# =====================================================================
# КРОК 4. Функція, що повертає рядок
# =====================================================================
# Описуємо state(t), яка повертає "АВАРІЯ", якщо t > 100,
# і "НОРМА" в іншому разі.
#
# Кілька return в одній функції — це нормально.
# Перший виконаний return завершує роботу функції.

def state(t_c):
    if t_c > 100:
        return "АВАРІЯ"
    elif t_c < 100:
        return "НОРМА"

    return "100 °C"

# =====================================================================
# КРОК 5. Застосування до вводу користувача
# =====================================================================
# Запитуємо температуру і виводимо одним рядком:
#   значення в °C, значення в K і стан.

while True:
    value = input("Задайте температуру або стоп: \n")
    if value == "стоп":
        break

    t_c = float(value)
    status = state(t_c)
    print(status)